---
kind: method
id: M:Autodesk.Revit.DB.IFC.ImporterIFC.SetFile(Autodesk.Revit.DB.IFC.IFCFile)
source: html/4b33d4c1-a06b-400d-7ecc-d3b24b3413aa.htm
---
# Autodesk.Revit.DB.IFC.ImporterIFC.SetFile Method

Sets the handle to the IFC file being created during this import operation.

## Syntax (C#)
```csharp
public void SetFile(
	IFCFile file
)
```

## Parameters
- **file** (`Autodesk.Revit.DB.IFC.IFCFile`) - The handle to the file.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null